In [414]:
import pandas as pd
import numpy as np

In [415]:
pd.__version__

'2.3.3'

In [416]:
obj=pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [417]:
obj.array

<NumpyExtensionArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [418]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [419]:
obj2=pd.Series([4,7,-5,3], index=['a', 'b', 'c', 'd'])
obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [420]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [421]:
obj2['c']

np.int64(-5)

In [422]:
obj2["b"]=45

In [423]:
obj2

a     4
b    45
c    -5
d     3
dtype: int64

In [424]:
obj2[["b", "c", "d"]]

b    45
c    -5
d     3
dtype: int64

In [425]:
np.exp(obj2)

a    5.459815e+01
b    3.493427e+19
c    6.737947e-03
d    2.008554e+01
dtype: float64

In [426]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
obj3=pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [427]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [428]:
states=["California", "Ohio", "Oregon", "Texas"]
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [429]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [430]:
obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [431]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [432]:
obj4 + obj3

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [433]:
obj4.name = "population"
obj4.index.name="state"

In [434]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [435]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [436]:
obj.index=["Bob", "Steve", "Jeff", "Ryan"]
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

# Data Frame

In [437]:
data={"State":["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
      "Year":[2000, 2001, 2002, 2001, 2002, 2003],
      "Pop":[1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame=pd.DataFrame(data)
frame

    State  Year  Pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [438]:
frame.head()

    State  Year  Pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [439]:
frame.tail()

    State  Year  Pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [440]:
pd.DataFrame(data, columns=["Year", "State", "Pop"])

   Year   State  Pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [441]:
frame2=pd.DataFrame(data, columns=["Year", "State", "Pop", "Debt"])
frame2

   Year   State  Pop Debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [442]:
frame2.columns

Index(['Year', 'State', 'Pop', 'Debt'], dtype='object')

In [443]:
frame2.Year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: Year, dtype: int64

In [444]:
frame2.State

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: State, dtype: object

In [445]:
frame2.loc[1]

Year     2001
State    Ohio
Pop       1.7
Debt      NaN
Name: 1, dtype: object

In [446]:
frame2.iloc[2]

Year     2002
State    Ohio
Pop       3.6
Debt      NaN
Name: 2, dtype: object

In [447]:
frame2["Debt"] = 16.5
frame2

   Year   State  Pop  Debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [448]:
frame2["eastern"] = frame2["State"] == "Ohio"
frame2

   Year   State  Pop  Debt  eastern
0  2000    Ohio  1.5  16.5     True
1  2001    Ohio  1.7  16.5     True
2  2002    Ohio  3.6  16.5     True
3  2001  Nevada  2.4  16.5    False
4  2002  Nevada  2.9  16.5    False
5  2003  Nevada  3.2  16.5    False

In [449]:
del frame2["eastern"]
frame2.columns

Index(['Year', 'State', 'Pop', 'Debt'], dtype='object')

In [450]:
population = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
              "Nevada": {2001: 2.4, 2002: 2.9}}
frame3 = pd.DataFrame(population)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [451]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [452]:
pd.DataFrame(population, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [453]:
pdata = {"Ohio": frame3["Ohio"][:-1],
         "Nevada": frame3["Nevada"][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [454]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [455]:
pd.DataFrame([
    {"A": 1, "B": 2},
    {"A": 3, "C": 4}
])

   A    B    C
0  1  2.0  NaN
1  3  NaN  4.0

In [456]:
frame3.index.name = "year"
frame3.columns.name = "state"
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [457]:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])
index=obj.index
index[1:]

Index(['b', 'c'], dtype='object')

In [458]:
# index[1] = "d" # TypeError("Index does not support mutable operations")

In [459]:
levels=pd.Index(np.arange(3))
levels

Index([0, 1, 2], dtype='int64')

In [460]:
obj2=pd.Series([1.5, -2.5, 0], index=levels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [461]:
obj2.index is levels

True

In [462]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [463]:
pd.Index(["foo", "foo", "bar", "bar"])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

# Essential Functionality

In [464]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [465]:
obj2=obj.reindex(["a", "b", "c", "d", "e"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [466]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [467]:
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [468]:
obj3.reindex(range(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [469]:
obj3.reindex(range(6), method="nearest")

0      blue
1    purple
2    purple
3    yellow
4    yellow
5    yellow
dtype: object

In [470]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [471]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=["a", "c", "d"],
                     columns=["Ohio", "Texas", "California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [472]:
frame2 = frame.reindex(index=["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [473]:
states = ["Texas", "Utah", "California"]
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [474]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [475]:
frame.loc[["a", "d", "c"], ["California", "Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

In [476]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [477]:
new_obj = obj.drop("c")
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [478]:
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [479]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [480]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [481]:
data.drop(["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [482]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [483]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [484]:
data.drop("three", axis=1)

          one  two  four
Ohio        0    1     3
Colorado    4    5     7
Utah        8    9    11
New York   12   13    15

In [485]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [486]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [487]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=["a", "c", "e", "f", "g"])
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [488]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

# Arithmetic and Data Alignment

In [489]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)),columns=list("bcd"), 
                   index=["Ohio", "Texas", "Colorado"])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [490]:
df2 = pd.DataFrame(np.arange(12.).reshape((4,3)),columns=list("bde"),
                   index=["Utah", "Ohio", "Texas", "Oregon"])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [491]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [492]:
df1 = pd.DataFrame({"A": [1, 2]})
df2 = pd.DataFrame({"B": [3, 4]})
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN